masterinterface/datasets/templates/datasets/query_template.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
      xmlns:xsd="http://www.w3.org/2001/XMLSchema"
      xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <Query xmlns="http://vph-share.eu/dms/">
      <doc>
        <qquery >
              <select>
                  {% for field in select %}
                  <selectitem returnas="{{ field.displayAs }}">
                      <field fieldname="{{ field.name }}" publishaddress="{{ dataset.metadata.publishaddress }}" dbname="{{ dataset.metadata.dbname }}" tablename="{{ field.tablename }}" type="{{ field.type }}"/>
                  </selectitem>
                  {% endfor %}
              </select>
              <where>
                  {% for conditions in where %}
                      {% if conditions.connector == "and" %}
                      <qlogicop operator=”AND”/>
                      {% elif conditions.connector == "or" %}
                      <qlogicop operator=”OR”/>
                      {% endif %}
                      {% if not conditions.group|length_is:1 %}
                      <qgroup>
                      {% endif %}
                      {% for operation in conditions.group %}
                          {% if operation.connector == "and" %}
                          <qlogicop operator=”AND”/>
                          {% elif operation.connector == "or" %}
                          <qlogicop operator=”OR”/>
                          {% endif %}
                          <qrelop operator="{{ operation.operator }}">
                              <leftnode>
                                  <field fieldname="{{ operation.name }}" publishaddress="{{ dataset.metadata.publishaddress }}" dbname="{{ dataset.metadata.dbname }}" tablename="{{ operation.tablename }}" type="{{ operation.type }}"/>
                              </leftnode>
                              <rightnode>
                              <qvalue type="{{ operation.valueType }}">{{ operation.value }}</qvalue>
                              </rightnode>
                          </qrelop>
                      {% endfor %}
                      {% if not conditions.group|length_is:1 %}
                      </qgroup>
                      {% endif %}
                  {% endfor %}
              </where>
          </qquery>
      </doc>
    </Query>
  </soap:Body>
</soap:Envelope>
